# -*- coding: utf-8 -*-

# 지도 파일과 선거구 파일 사이의 불일치
mismatches = {}

# 지도 파일에서 시 정보가 미반영된 구 (e.g., 성산구 -> 창원시성산구)
mismatches["municipality_rename"] = {
	2012: {37012: u"포항시북구", 37011: u"포항시남구", 38111: u"창원시의창구", 38112: u"창원시성산구", 38113: u"창원시마산합포구", 38114: u"창원시마산회원구", 38115: u"창원시진해구"},
	2013: {}
}

# 지도 파일 작성 시점과 선거구 획정 시점 사이에 읍면동 (submunicipality) 이름변경되거나 분할되거나 합쳐진 경우 등 (e.g., 장지동 -> 위례동)
mismatches["submunicipality_changed"] = {
	19: {
		(23080, u'청라동'): [u'청라1동', u'청라2동'], # merged
		(22070, u'두류1\xb72동'): u'두류1,2동',
		(33012, u'봉명2송정동'): u'봉명2·송정동',
		(31200, u'진동면'): u'군내면' # does not exist in the map; pick one near
	}, 
	20: {
		# name changed or splitted
		(11240, u'위례동'): u'장지동',
		(21120, u'가덕도동'): u'천가동',
		(21090, u'우3동'): u'우1동',
		(23040, u'송도3동'): u'송도1동',
		(23070, u'계양3동'): u'계양1동',
		(25040, u'노은3동'): u'노은2동',
		(31012, u'금곡동'): u'금호동',
		(31012, u'호매실동'): u'금호동',
		(31014, u'광교1동'): u'광교동',
		(31014, u'광교2동'): u'광교동',
		(31023, u'정자동'): u'정자1동',
		(31150, u'장곡동'): u'연성동',
		(31150, u'월곶동'): u'군자동',
		(31230, u'운양동'): u'김포2동',
		(31240, u'남양읍'): u'남양동',
		(31240, u'동탄4동'): u'동탄면',
		(31250, u'남한산성면'): u'중부면',
		# data quality issue
		(22070, u'두류1\xb72동'): u'두류1,2동',
		(21050, u'당감1동'): u'당감제1동',
		(21050, u'가야1동'): u'가야제1동',
		# merged
		(21050, u'부전1동'): [u'범전동', u'부전1동'],
		(21050, u'전포1동'): [u'전포1동', u'전포3동'],
		(21050, u'범천2동'): [u'범천2동', u'범천4동'],
		(21090, u'반송1동'): [u'반송1동', u'반송3동'],
		(31200, u'군내면'): [u'군내면', u'장단면'] # no population
	}
}

# 새로 만들어진 시군구 (municipality)
mismatches["new_municipality"] = {
	19: {},
	20: {
		u'청주시상당구': [u'낭성면', u'미원면', u'가덕면', u'남일면', u'문의면', u'중앙동', u'성안동', u'탑·대성동', u'영운동', u'금천동', u'용담·명암·산성동', u'용암제1동', u'용암제2동'],
		u'청주시서원구': [u'남이면', u'현도면', u'사직1동', u'사직2동', u'사창동', u'모충동', u'산남동', u'분평동', u'수곡1동', u'수곡2동', u'성화·개신·죽림동'],
		u'청주시흥덕구': [u'오송읍', u'강내면', u'옥산면', u'운천·신봉동', u'복대제1동', u'복대제2동', u'가경동', u'봉명제1동', u'봉명제2·송정동', u'강서제1동', u'강서제2동'],
		u'청주시청원구': [u'내수읍', u'오창읍', u'북이면', u'우암동', u'내덕제1동', u'내덕제2동', u'율량·사천동', u'오근장동'],
	}
}